#include <stdio.h>
#include <locale.h>
void name()
{
	setlocale(LC_ALL, "RUS");
	puts("*********************************************");
	puts("*                                           *");
	puts("*    Тема лабораторной работы: Разработка   *");
	puts("*           консольного приложения          *");
	puts("*     выполнил: Антон Харебин               *");
	puts("*********************************************");
}

void date()
{
	puts("       __    __       __    __     __   __   __   __ ");
	puts("      |  |  |  |     |  |  |  |   |  | |  | |  | |   ");
	puts("        /    __|     |  |  |__|     /  |  | |  | |__ ");
	puts("       /       |     |  |     |    /   |  | |  | |  |");
	puts("      /__   |__| .   |__|   __| . /__  |__| |__| |__|");
	}
void main()
{
	name();
	date();
	return 0;
}
